
// 模块ID
export enum MenuId
{
    /*------------- 系统  ------------ */

    
    /** 通知 */
    Notice = 0, // 临时

    /*---------无按钮 1------ */
    /** 主界面 */
    Home = 100,
    /** 战斗 */
    War = 601,

    /** 登录 */
    Login = 101,

    /** 剧情引导 */
    Plot = 102,


    /*---------方位下 2------ */
    /** 招募 */
    Gashapon = 200,

    /** 英雄 */
    Hero    = 201,
    /** 背包 */
    Bag     = 202,
    /** 装备 */
    Equip    = 203,

    /** 战魂 */
    Draug  = 204,
    /** 征战 */
    Sections = 207,

    /*---------方位左下 3------ */

    /** 任务 */
    Quest = 300,

    /** 组队大厅 */
    Team = 303,

    /** 备战 */
    BattlePlan = 304,

    PVPHall = 401,
    /** 战役 */
    PVEHall = 402,
    
    /*---------方位上 5------ */
    /** 设置 */
    SystemSetting = 500,

    /** 邮件 */
    Mail = 501,

    /** 排行榜 */
    Rank = 502,

    /** 角色信息 */
    PlayerInfo = 503,


    

    

    


}

window["MenuId"] = MenuId;